In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
print(pd.__version__)

1.5.2

In [88]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)
# EQUAL
data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df = pd.DataFrame.from_dict(data)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [10]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [27]:
data = {'X':[1,2,3], 'Y' :[4,5,6]}
print(pd.DataFrame.from_dict(data), '\n')

data = [[1,2,3], [4,5,6]]
print(pd.DataFrame(data, columns=['X', 'Y', 'Z']), '\n')

print(pd.DataFrame({'X': [1,2,3], 'Y':[4,5,6]}, index=['First', 'Second', 'Third']) ,'\n \n')

data = {'Category':['X', 'Y', 'Z'], 'first':[1,2,3], 'second' : [4,5,6]}
print(pd.DataFrame.from_dict(data), '\n')
print(pd.DataFrame.from_dict(data).transpose(), '\n')   # Transpose of DataFrame

   X  Y
0  1  4
1  2  5
2  3  6

   X  Y  Z
0  1  2  3
1  4  5  6

        X  Y
First   1  4
Second  2  5
Third   3  6


  Category  first  second
0        X      1       4
1        Y      2       5
2        Z      3       6

          0  1  2
Category  X  Y  Z
first     1  2  3
second    4  5  6

In [30]:
data = [[1, 5, 10], [2, 6, 9], [3, 7, 8]]
df = pd.DataFrame(data, index = ["First",'Second','Third'], columns=['11','22','33'])
print(df, '\n')
print(df.transpose())

        11  22  33
First    1   5  10
Second   2   6   9
Third    3   7   8

    First  Second  Third
11      1       2      3
22      5       6      7
33     10       9      8

In [32]:
# data in the form of list of tuples
data = [('Peter', 18, 7),
        ('Riff', 15, 6),
    ('John', 17, 8),
    ('Michel', 18, 7),
    ('Sheli', 17, 5) ]
  
  # create DataFrame using data
df = pd.DataFrame(data, columns =['Team', 'Age', 'Score'])
  
a = df.pivot('Team', 'Score','Age')
print(a)

Score      5     6     7     8
Team
John     NaN   NaN   NaN  17.0
Michel   NaN   NaN  18.0   NaN
Peter    NaN   NaN  18.0   NaN
Riff     NaN  15.0   NaN   NaN
Sheli   17.0   NaN   NaN   NaN

C:\Users\amins\AppData\Local\Temp\ipykernel_12648\3054508486.py:11: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  a = df.pivot('Team', 'Score','Age')

In [37]:
# Initialise data to lists.
data = [{'Geeks': 'dataframe', 'For': 'using', 'geeks': 'list'},
        {'Geeks':10, 'For': 20, 'geeks': 30}]
 
df = pd.DataFrame.from_records(data,index=['1', '2'])
print(df,'\n')
 
df = pd.DataFrame.from_dict(data)
print(df,'\n')

df=pd.json_normalize(data)
print(df,'\n')

df = pd.DataFrame(data)
print(df,'\n')

       Geeks    For geeks
1  dataframe  using  list
2         10     20    30

       Geeks    For geeks
0  dataframe  using  list
1         10     20    30

       Geeks    For geeks
0  dataframe  using  list
1         10     20    30

       Geeks    For geeks
0  dataframe  using  list
1         10     20    30

In [43]:
# List of nested dictionary initialization
list = [
        {
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                   ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                   ],
        "Name": "Chunky Pandey"
        }
       ]
  
#print(list)
# rows list initialization
rows = []
  
# appending rows
for data in list:
    data_row = data['Student']
    time = data['Name']
      
    for row in data_row:
        row['Name']= time
        rows.append(row)
  
# using data frame
df = pd.DataFrame(rows)
print(df, '\n \n')

# using pivot_table
df = df.pivot_table(index ='Name', columns =['Grade'],
                        values =['Exam']).reset_index()
  
# Defining columns
df.columns =['Name', 'Maths', 'Physics', 'Chemistry']
  
# print dataframe
print(df,'\n \n')

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey


            Name  Maths  Physics  Chemistry
0  Chunky Pandey   89.0     80.0        NaN
1     Paras Jain   90.0     99.0       97.0

In [45]:
# Let's create a Dataframe
df = pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
  
# Let's create the index
index_ = [pd.Period('02-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
  
# Set the index
df.index = index_
  
# Let's print the dataframe
print(df, '\n')

df = df.replace(to_replace ='[nN]ew', value = 'New_', regex = True)
print(df, '\n')

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

                 City        Event   Cost
2018-02     New_ York        Music  10000
2018-04       Parague       Poetry   5000
2018-06    New_ Delhi      Theatre  15000
2018-10        Venice       Comedy   2000
2018-12  New_ Orleans  Tech_Summit  12000

In [56]:
df1 = pd.Series(['Jitender','Purnima','Arpit','Jyoti'])
df2 = pd.Series([210,211,114,178])
df = pd.DataFrame({'Author': df1,'Article':df2 })
age = [21,21,23]
df3=pd.Series(age)
df['Age']=df3
df['Age'].astype('float')
df

     Author  Article   Age
0  Jitender      210  21.0
1   Purnima      211  21.0
2     Arpit      114  23.0
3     Jyoti      178   NaN

In [59]:
# import the StrinIO function
# from io module
from io import StringIO
 
# wrap the string data in StringIO function
StringData = StringIO("""Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """)
 
# let's read the data using the Pandas
# read_csv() function
df = pd.read_csv(StringData, sep =";")
 
# Print the dataframe
print(df,'\n \n')

            Date    Event   Cost
0      10/2/2011    Music  10000
1      11/2/2011   Poetry  12000
2      12/2/2011  Theatre   5000
3      13/2/2011   Comedy   8000

In [65]:
# Create the dataframe
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':[' UMbreLla', '  maTtress', 'BaDmintoN ', 'Shuttle'],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 8, 15, 10]})
 
# Print the dataframe
#capitalize() returns a string where the first character is upper case, and the rest is lower case.
print(df,'\n \n')
for i in range(df.shape[0]):
    df.iat[i, 1]= df.iat[i, 1].strip().capitalize()        
print(df,'\n \n')

df['Product'] = df['Product'].apply(lambda x : x.strip().capitalize())
print(df, '\n \n')

        Date     Product  Updated_Price  Discount
0  10/2/2011    UMbreLla           1250        10
1  11/2/2011    maTtress           1450         8
2  12/2/2011  BaDmintoN            1550        15
3  13/2/2011     Shuttle            400        10


        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011   Mattress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10


        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011   Mattress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10

In [79]:
index_ = ['A','B','C','D','E']
col_ = ['a','b','c','d','e']
df = pd.DataFrame(np.random.rand(5,5), index=index_, columns=col_)
print(df,'\n\n')

# reindex- Change row order / column order
print('\n\nDataframe after reindexing rows: \n',
df.reindex(['B', 'D', 'A', 'C', 'E']))

df.reindex(['U','A','B','C','Z'])

df.reindex(['e','a','c','b','d'], axis='columns')
df.reindex(['a','b','c','g','h'], axis='columns', fill_value='data missing')  # fillna(1.5)

          a         b         c         d         e
A  0.869706  0.792029  0.984968  0.590480  0.440888
B  0.223426  0.642966  0.318618  0.725404  0.786895
C  0.440590  0.939629  0.030255  0.307267  0.030574
D  0.708488  0.207521  0.430225  0.991939  0.227100
E  0.081127  0.894253  0.642914  0.669404  0.911878




Dataframe after reindexing rows:
           a         b         c         d         e
B  0.223426  0.642966  0.318618  0.725404  0.786895
D  0.708488  0.207521  0.430225  0.991939  0.227100
A  0.869706  0.792029  0.984968  0.590480  0.440888
C  0.440590  0.939629  0.030255  0.307267  0.030574
E  0.081127  0.894253  0.642914  0.669404  0.911878

          a         b         c             g             h
A  0.869706  0.792029  0.984968  data missing  data missing
B  0.223426  0.642966  0.318618  data missing  data missing
C  0.440590  0.939629  0.030255  data missing  data missing
D  0.708488  0.207521  0.430225  data missing  data missing
E  0.081127  0.894253  0.642914  data missing  data missing

In [83]:
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
        'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
        'Age': [42, 52, 36, 21, 23], 
        'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}
df = pd.DataFrame(initial_data)

# Create new column using dictionary
new_data = { 
             "Mohan":"IAS",
             "Ram":"B.Com",
             "Tina":"LLB",
             "Jeetu":"B.Tech",
             "Meera":"MBBS" }
  
# combine this new data with existing DataFrame
df["Qualification"] = df["First_name"].map(new_data)
print(df,'\n \n')

new_data = { "Ram":"Shyam",
             "Tina":"Riya",
             "Jeetu":"Jitender" }
  
print(df, end ="\n\n")
  
# combine this new data with existing DataFrame
df = df.replace({"First_name":new_data})
print(df,'\n\n')

  First_name Last_name  Age    City Qualification
0        Ram     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Tina       Ali   36    Pune           LLB
3      Jeetu    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS


  First_name Last_name  Age    City Qualification
0        Ram     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Tina       Ali   36    Pune           LLB
3      Jeetu    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS

  First_name Last_name  Age    City Qualification
0      Shyam     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Riya       Ali   36    Pune           LLB
3   Jitender    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS

In [87]:
df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# it was print the first 5-rows
print(df.head()) 

df.stack().head(15)
# stack() method
# Stack method works with the MultiIndex objects in DataFrame, it returning a DataFrame with an index with a new inner-most level of row labels. It changes the wide table to a long table.

# unstack() method:
# unstack is similar to stack method, It also works with multi-index objects in dataframe, producing a reshaped DataFrame with a new inner-most level of column labels.

# melt() method:
# Melt in pandas reshape dataframe from wide format to long format. It uses the “id_vars[‘col_names’]” for melt the dataframe by column names.

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                 0.0
   Position                PG
   Age                   25.0
   Height                 6-2
   Weight               180.0
   College              Texas
   Salary           7730337.0
1  Name           Jae Crowder
   Team        Boston Celtics
   Number                99.0
   Position                SF
   Age                   25.0
   Height                 6-6
dtype: object

In [98]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] }
  
index = ['a', 'b', 'c', 'd', 'e']
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data, index=index)
print(df,'\n\n')  
# Make Own Index as index
# In this case default index is exist 
df.reset_index(inplace = True)
print(df)

     Name  Age    Address Qualification
a     Jai   27      Delhi           Msc
b  Princi   24     Kanpur            MA
c  Gaurav   22  Allahabad           MCA
d    Anuj   32    Kannauj           Phd
e   Geeku   15      Noida          10th


  index    Name  Age    Address Qualification
0     a     Jai   27      Delhi           Msc
1     b  Princi   24     Kanpur            MA
2     c  Gaurav   22  Allahabad           MCA
3     d    Anuj   32    Kannauj           Phd
4     e   Geeku   15      Noida          10th

In [100]:
# Create a dataFrame using dictionary
df=pd.DataFrame({"Name":['Tom','Nick','John','Peter'],
                 "Age":[15,26,17,28]})
  
# Creates a dataFrame with
# 2 columns and 4 rows
df.index=['row_1','row_2','row_3','row_4']
df.columns=['Col1','Col_2']
# df = df.rename(columns={'Col_1':'New_Col_1'})
df = df.rename(columns = {"Col_1":"Mod_col"})
df

        Col1  Col_2
row_1    Tom     15
row_2   Nick     26
row_3   John     17
row_4  Peter     28

In [38]:
from datetime import datetime
import numpy as np
 


range_date = pd.date_range(start ='1/1/2019', end ='1/08/2019',
                                                   freq ='Min')
 
df = pd.DataFrame(range_date, columns =['date'])
df['data'] = np.random.randint(0, 100, size =(len(range_date)))
 
print(df.head(10))

                 date  data
0 2019-01-01 00:00:00    14
1 2019-01-01 00:01:00    18
2 2019-01-01 00:02:00    68
3 2019-01-01 00:03:00    67
4 2019-01-01 00:04:00    60
5 2019-01-01 00:05:00    54
6 2019-01-01 00:06:00    78
7 2019-01-01 00:07:00    29
8 2019-01-01 00:08:00     5
9 2019-01-01 00:09:00    44

# df.iterrows() -  iterate over rows in Pandas Dataframe
  df['ColumnName'][Rownumber] == df.loc[Rownumber,'ColumnName'] == df.iloc[Rownumber,Colnumber]     -    
  df['name'][0]=df.loc[0,'name']=Sujeet

In [11]:

# list of dicts
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
 
df = pd.DataFrame(input_df)
print('Original DataFrame: \n', df, df.shape)


print('\nRows iterated using iterrows() : ')
for index, row in df.iterrows():
    print(row['name'], row['age'])

Original DataFrame:
      name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12 (3, 2)

Rows iterated using iterrows() :
Sujeet 10 0
Sameer 11 1
Sumit 12 2

In [12]:
# Define a dictionary containing students data
data = {'Name': ['Ankit', 'Amit',
                 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce',
                   'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age', 
                                 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", df)
  
print("\nIterating over rows using index attribute :\n")
  
# iterate through each row and select
# 'Name' and 'Stream' column respectively.
for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

# Selecting rows in pandas DataFrame based on conditions
isin() , ~isin()

In [36]:
record = {
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] 
}

options = ['Math', 'Commerce']

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

print(dataframe[dataframe['Percentage'] > 80], '\n')
print(dataframe.loc[dataframe['Percentage'] > 80], '\n')

print(dataframe.loc[dataframe['Stream'].isin(options)],'\n')
print(dataframe.loc[~dataframe['Stream'].isin(options)],'\n')
print("two conditions",dataframe.loc[(dataframe['Stream'].isin(options)) &( dataframe['Age']==21) ],'\n')
dataframe

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

        Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95
5    Shaurya   21  Science          78

two conditions     Name  Age Stream  Percentage
0  Ankit   21   Math          88

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

# Drop a give column in DataFram -  df.drop([col index])   

Insert row at given position in Pandas Dataframe

Ranking 

Sorting

Max = df.max()

In [50]:
df = pd.DataFrame({'Date':['10/2/2011', '12/2/2011', '13/2/2011', '14/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
 
# Let's visualize the dataframe
print(df)
row_value = ['11/2/2011', 'Wrestling', 12000]
df.loc[3:] = df.loc[2:]
df.loc[2] = row_value
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  12/2/2011   Poetry   5000
2  13/2/2011  Theatre  15000
3  14/2/2011   Comedy   2000

        Date      Event   Cost
0  10/2/2011      Music  10000
1  12/2/2011     Poetry   5000
2  11/2/2011  Wrestling  12000
3  14/2/2011     Comedy   2000

In [59]:
movies = {'Name': ['The Godfather', 'Bird Box', 'Fight Club'],
         'Year': ['1972', '2018', '1999'],
         'Rating': ['9.2', '6.8', '8.8']}
  
df = pd.DataFrame(movies)
print(df)

df['Ranking'] = df['Rating'].rank(ascending=False)
df = df.set_index('Ranking')
df = df.sort_index()
df

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

                  Name  Year Rating
Ranking
1.0      The Godfather  1972    9.2
2.0         Fight Club  1999    8.8
3.0           Bird Box  2018    6.8

In [73]:
data = {'name': ['Simon', 'Marsh', 'Gaurav', 'Alex', 'Selena'], 
        'Maths': [8, 5, 6, 9, 7], 
        'Science': [7, 9, 5, 4, 7],
        'English': [7, 4, 7, 6, 8]}
  
df = pd.DataFrame(data)
  
# Sort the dataframe’s rows by Science,
# in descending order
a = df.sort_values(by =['Science','Maths'])
# a = df.sort_values(by ='Science', na_position ='first' )   #If you want missing values first
print("Sorting rows by Science:\n \n", a)


# the row with the Max of a spesific column
df[df['Maths'] == df['Maths'].max()]

Sorting rows by Science:

      name  Maths  Science  English
3    Alex      9        4        6
2  Gaurav      6        5        7
4  Selena      7        7        8
0   Simon      8        7        7
1   Marsh      5        9        4

   name  Maths  Science  English
3  Alex      9        4        6

In [80]:
# Creating the dataframe with dict of lists
df = pd.DataFrame({'Name': ['Geeks', 'Peter', 'James', 'Jack', 'Lisa'],
                   'Team': ['Boston', 'Boston', 'Boston', 'Chele', 'Barse'],
                   'Position': ['PG', 'PG', 'UG', 'PG', 'UG'],
                   'Number': [3, 4, 7, 11, 5],
                   'Age': [33, 25, 34, 35, 28],
                   'Height': ['6-2', '6-4', '5-9', '6-1', '5-8'],
                   'Weight': [89, 79, 113, 78, 84],
                   'College': ['MIT', 'MIT', 'MIT', 'Stanford', 'Stanford'],
                   'Salary': [99999, 99994, 89999, 78889, 87779]},
                   index =['ind1', 'ind2', 'ind3', 'ind4', 'ind5'])
print(df, "\n")

print("Check PG values in Position column:\n", df['Position'].str.contains("PG"))
print(df[df['Position'].str.contains('PG')])

       Name    Team Position  Number  Age Height  Weight   College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89       MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79       MIT   99994
ind3  James  Boston       UG       7   34    5-9     113       MIT   89999
ind4   Jack   Chele       PG      11   35    6-1      78  Stanford   78889
ind5   Lisa   Barse       UG       5   28    5-8      84  Stanford   87779

Check PG values in Position column:
 ind1     True
ind2     True
ind3    False
ind4     True
ind5    False
Name: Position, dtype: bool
       Name    Team Position  Number  Age Height  Weight   College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89       MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79       MIT   99994
ind4   Jack   Chele       PG      11   35    6-1      78  Stanford   78889

In [85]:
# Creating a dict of lists
data = {'Name':["Akash", "Geeku", "Pankaj", "Sumitra","Ramlal"],
       'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
       'Score':["80","90","60", "30", "50"],
       'Result': ["Pass","Pass","Pass","Fail","Fail"]}
 
# creating a dataframe
df = pd.DataFrame(data)
  
df = df.pivot('Result','Name','Branch')
df

C:\Users\amins\AppData\Local\Temp\ipykernel_20376\4043173772.py:10: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df = df.pivot('Result','Name','Branch')

Name     Akash Geeku Pankaj Ramlal Sumitra
Result
Fail       NaN   NaN    NaN    BCA  B.Tech
Pass    B.Tech   MBA    BCA    NaN     NaN

In [87]:

# import the pandas lib as pd
import pandas as pd
  
# create a dictionary
dictionary = {'A' : 50, 'B' : 10, 'C' : 80}
  
# create a series
series = pd.Series(dictionary, index =['D', 'E', 'A'])
  
print(series)

D     NaN
E     NaN
A    50.0
dtype: float64